      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : USR0003
      *
      * Die Betriebsart &1 ist bereits eingestellt worden.
      *
     D USR0003         DS
     D  USR00031                    010A   INZ(*BLANKS)
     D  USR00032                    010A   INZ(*BLANKS)
     D  USR00033                    010A   INZ(*BLANKS)
     D USR0003#        S              8B 0 INZ(0030)
      *
