      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : USR0001
      *
      * Länge ausserhalb des gültigen Bereichs.
      *
     D USR0001         DS
      *   Keine Ersatzvariablen definiert!
     D USR0001#        S              8B 0 INZ(0000)
      *
