      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : USR0004
      *
      * Die Betriebsart &1 ist bereits eingestellt worden.
      *
     D USR0004         DS
     D  USR00041                    010A   INZ(*BLANKS)
     D  USR00042                    010A   INZ(*BLANKS)
     D  USR00043                    010A   INZ(*BLANKS)
     D USR0004#        S              8B 0 INZ(0030)
      *
