      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : USR0002
      *
      * Fehler bei Befehlsausführung in Zeile &1.
      *
     D USR0002         DS
     D  USR00021                    006P 2 INZ(*ZEROS )
     D  USR00022                    512A   INZ(*BLANKS)
     D USR0002#        S              8B 0 INZ(0516)
      *
