**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : USR0001

// Länge ausserhalb des gültigen Bereichs.

dcl-ds USR0001;
end-ds;
//   Keine Ersatzvariablen definiert!
dcl-s USR0001# bindec(8) inz(0000);

